Repository: SpaceTrucker2196/MeowPassword
Catalog: Sources/MeowPasswordApp/Localizable.xcstrings
Source language: en
Languages: de, fr, ja

source: GENERATE!
de: GENERIEREN!
fr: GÉNÉRER !
ja: 生成！

source: WINNER!
de: GEWINNER!
fr: GAGNANT !
ja: 優勝！

source: SCORE
de: PUNKTE
ja: スコア

source: CANDIDATES
de: KANDIDATEN
fr: CANDIDATS
ja: 候補

source: JUDGE!
de: BEWERTEN!
fr: ÉVALUER !
ja: 審査！

source: RULES
de: REGELN
fr: RÈGLES
ja: ルール

source: NUMBERS
de: ZAHLEN
fr: CHIFFRES
ja: 数字

source: SYMBOLS
de: SYMBOLE
fr: SYMBOLES
ja: 記号

source: MAX LENGTH
de: MAX. LÄNGE
fr: LONGUEUR MAX
ja: 最大の長さ

source: COMPOSE
de: ERSTELLEN
fr: COMPOSER
ja: 作成

source: DECODE
de: DEKODIEREN
fr: DÉCODER
ja: デコード

source: SECRET MESSAGE
de: GEHEIME NACHRICHT
fr: MESSAGE SECRET
ja: ひみつのメッセージ

source: PICK A CAT!
de: KATZE WÄHLEN!
fr: CHOISIR UN CHAT !
ja: ネコをえらぶ！

source: MESSAGE!
de: NACHRICHT!
ja: メッセージ！

source: DECODE A MEOWGRAM
de: MEOWGRAM DEKODIEREN
fr: DÉCODER UN MEOWGRAM
ja: MEOWGRAMをデコード

source: DECODE MEOWGRAM!
de: MEOWGRAM DEKODIEREN!
fr: DÉCODER LE MEOWGRAM !
ja: MEOWGRAMをデコード！

source: SAVE
de: SPEICHERN
fr: ENREGISTRER
ja: 保存

source: PASTE
de: EINFÜGEN
fr: COLLER
ja: 貼り付け

source: GENERATE
de: ERZEUGEN
fr: GÉNÉRER
ja: 生成

source: EMBED!
de: EINBETTEN!
fr: INTÉGRER !
ja: うめこむ！

source: EMBEDDING…
de: WIRD EINGEBETTET…
fr: INTÉGRATION…
ja: うめこみ中…

source: JUDGING…
de: WIRD BEWERTET…
fr: ÉVALUATION…
ja: しんさ中…

source: DECODING…
de: WIRD DEKODIERT…
fr: DÉCODAGE…
ja: デコード中…

source: READY…?
de: BEREIT…?
fr: PRÊT…?
ja: いくよ…？

source: PASTE A PASSWORD…
de: PASSWORT EINFÜGEN…
fr: COLLEZ UN MOT DE PASSE…
ja: パスワードを貼り付け…

source: ANALYZE!
de: ANALYSIEREN!
fr: ANALYSER !
ja: しんさ！

source: Copy
de: Kopieren
fr: Copier
ja: コピー

source: Copy message
de: Nachricht kopieren
fr: Copier le message
ja: メッセージをコピー

source: Generate a voice-friendly cat key
de: Erzeuge einen vorlesbaren Katzenschlüssel
fr: Générer une clé féline facile à lire
ja: 読み上げやすい猫のキーを生成

source: PREVIEW
de: VORSCHAU
fr: APERÇU
ja: プレビュー

source: PSST… WHISPER SOMETHING
de: PSST… FLÜSTER ETWAS
fr: PSST… CHUCHOTEZ QUELQUE CHOSE
ja: こっそり…なにか囁いて

source: Embed to preview
de: Einbetten für Vorschau
fr: Intégrez pour prévisualiser
ja: 埋め込むとプレビュー

source: MESSAGE
de: NACHRICHT
ja: メッセージ

source: COPY
de: KOPIEREN
fr: COPIER
ja: コピー

source: OPEN
de: ÖFFNEN
fr: OUVRIR
ja: ひらく

source: DROP A MEOWGRAM PNG HERE
de: MEOWGRAM-PNG HIERHER ZIEHEN
fr: DÉPOSEZ UN PNG MEOWGRAM ICI
ja: MEOWGRAMのPNGをここにドロップ

source: ENTER IT IF THIS MEOWGRAM IS LOCKED
de: EINGEBEN, FALLS DIESES MEOWGRAM GESPERRT IST
fr: SAISISSEZ-LA SI CE MEOWGRAM EST VERROUILLÉ
ja: このMEOWGRAMがロックされている場合は入力

source: About MeowPassword
de: Über MeowPassword
fr: À propos de MeowPassword
ja: MeowPassword について

source: Generate Password
de: Passwort generieren
fr: Générer un mot de passe
ja: パスワードを生成

source: Generate + Copy
de: Generieren + Kopieren
fr: Générer + Copier
ja: 生成してコピー

source: New MeowGram…
de: Neues MeowGram…
fr: Nouveau MeowGram…
ja: 新しい MeowGram…

source: Decode MeowGram…
de: MeowGram dekodieren…
fr: Décoder un MeowGram…
ja: MeowGram をデコード…

source: Copy Best Password
de: Bestes Passwort kopieren
fr: Copier le meilleur mot de passe
ja: 最良のパスワードをコピー

source: Analyze Input
de: Eingabe analysieren
fr: Analyser la saisie
ja: 入力を分析

source: Install Command-Line Tool…
de: Kommandozeilen-Tool installieren…
fr: Installer l'outil en ligne de commande…
ja: コマンドラインツールをインストール…

source: MeowPassword Help
de: MeowPassword-Hilfe
fr: Aide MeowPassword
ja: MeowPassword ヘルプ

source: Project on GitHub
de: Projekt auf GitHub
fr: Projet sur GitHub
ja: GitHub のプロジェクト

source: Report an Issue…
de: Problem melden…
fr: Signaler un problème…
ja: 問題を報告…

source: Release Notes
de: Versionshinweise
fr: Notes de version
ja: リリースノート

source: A cat-name-based password generator with catified complexity scoring.
de: Ein Passwort-Generator auf Basis von Katzennamen mit katzifizierter Komplexitätsbewertung.
fr: Un générateur de mots de passe à base de noms de chats, avec un score de complexité félin.
ja: 猫の名前をもとにしたパスワード生成ツール。猫化された複雑さスコア付き。

source: Menu bar, Shortcuts, Services, and URL-scheme integration all wrap the same `meowpass` CLI.
de: Menüleiste, Kurzbefehle, Dienste und URL-Schema greifen alle auf dasselbe `meowpass`-CLI zu.
fr: La barre de menus, les Raccourcis, les Services et le schéma d'URL utilisent tous le même CLI `meowpass`.
ja: メニューバー、ショートカット、サービス、URLスキームはすべて同じ `meowpass` CLI を利用します。

source: Built with Swift + SwiftUI · MIT License © 2026 Jeffrey Kunzelman
de: Erstellt mit Swift + SwiftUI · MIT-Lizenz © 2026 Jeffrey Kunzelman
fr: Conçu avec Swift + SwiftUI · Licence MIT © 2026 Jeffrey Kunzelman
ja: Swift + SwiftUI で構築 · MIT ライセンス © 2026 Jeffrey Kunzelman

source: ★ GENERATE + COPY!
de: ★ GENERIEREN + KOPIEREN!
fr: ★ GÉNÉRER + COPIER !
ja: ★ 生成してコピー！

source: Generate (せいせい)
de: Generieren (せいせい)
fr: Générer (せいせい)
ja: 生成（せいせい）

source: Copy Best (コピー)
de: Bestes kopieren (コピー)
fr: Copier le meilleur (コピー)
ja: 最良をコピー（コピー）

source: Open MeowPassword… (ひらく)
de: MeowPassword öffnen… (ひらく)
fr: Ouvrir MeowPassword… (ひらく)
ja: MeowPassword をひらく（ひらく）

source: Quit
de: Beenden
fr: Quitter
ja: 終了

source: Generate MeowPassword
de: MeowPassword generieren
fr: Générer un MeowPassword
ja: MeowPassword を生成

source: Analyze Password
de: Passwort analysieren
fr: Analyser le mot de passe
ja: パスワードを分析

source: Generate + Copy MeowPassword
de: MeowPassword generieren + kopieren
fr: Générer + Copier un MeowPassword
ja: MeowPassword を生成してコピー

source: Generate a secure cat-name-based password.
de: Erzeuge ein sicheres Passwort aus Katzennamen.
fr: Générez un mot de passe sûr à base de noms de chats.
ja: 猫の名前をもとにした安全なパスワードを生成します。

source: Score a password using MeowPassword's complexity heuristics.
de: Bewerte ein Passwort mit den Komplexitäts-Heuristiken von MeowPassword.
fr: Notez un mot de passe avec les heuristiques de complexité de MeowPassword.
ja: MeowPassword の複雑さ評価でパスワードを採点します。

source: Generate a secure password and copy it to the clipboard.
de: Erzeuge ein sicheres Passwort und kopiere es in die Zwischenablage.
fr: Générez un mot de passe sûr et copiez-le dans le presse-papiers.
ja: 安全なパスワードを生成し、クリップボードにコピーします。

source: Numbers
de: Zahlen
fr: Chiffres
ja: 数字

source: Symbols
de: Symbole
fr: Symboles
ja: 記号

source: Maximum length
de: Maximale Länge
fr: Longueur maximale
ja: 最大の長さ

source: Copy to clipboard
de: In Zwischenablage kopieren
fr: Copier dans le presse-papiers
ja: クリップボードにコピー

source: Password
de: Passwort
fr: Mot de passe
ja: パスワード

source: Purrfect. Score %@/10.
de: Perfekt. Punktzahl %@/10.
fr: Purrfait. Score %@/10.
ja: パーフェクト。スコア %@/10。

source: Copied. Meow.
de: Kopiert. Miau.
fr: Copié. Miaou.
ja: コピーしました。ニャー。

source: Generate
de: Generieren
fr: Générer
ja: 生成

source: Analyze
de: Analysieren
fr: Analyser
ja: 分析

source: MeowPassword: no text selected
de: MeowPassword: kein Text ausgewählt
fr: MeowPassword : aucun texte sélectionné
ja: MeowPassword：テキストが選択されていません

source: Hiss! A kitten could paw this one open! Try a meowpass-generated password instead!
de: Fauch! Das knackt schon ein Kätzchen mit einer Pfote! Nimm lieber ein von meowpass erzeugtes Passwort!
fr: Fff ! Un chaton ouvrirait ça d'un coup de patte ! Prenez plutôt un mot de passe généré par meowpass !
ja: シャー！こんなの子猫でも前足でパッと開けちゃう！meowpassで作ったパスワードを使ってね！

source: Meow... this string is a bit too easy for a clever cat to guess.
de: Miau… diese Zeichenkette ist für eine schlaue Katze etwas zu leicht zu erraten.
fr: Miaou… cette chaîne est un peu trop facile à deviner pour un chat malin.
ja: ニャー…この文字列は賢い猫にはちょっと簡単に当てられちゃう。

source: Not bad, hooman! This string has decent whisker-resistance.
de: Nicht schlecht, Mensch! Diese Zeichenkette hat ordentlichen Schnurrhaar-Widerstand.
fr: Pas mal, humain ! Cette chaîne a une résistance de moustaches correcte.
ja: なかなかやるね、人間！この文字列はまずまずのヒゲ耐性があるよ。

source: Purrfect! This string is fur-midably complex. Even the cleverest cats can't crack it!
de: Perfekt! Diese Zeichenkette ist haaresträubend komplex. Selbst die schlausten Katzen knacken sie nicht!
fr: Purrfait ! Cette chaîne est d'une complexité à faire hérisser les poils. Même les chats les plus malins n'en viennent pas à bout !
ja: パーフェクト！この文字列は毛が逆立つほど複雑。どんな賢い猫にも破れないよ！

source: This image isn't a MeowGram (no provenance key found).
de: Dieses Bild ist kein MeowGram (kein Herkunftsschlüssel gefunden).
fr: Cette image n'est pas un MeowGram (aucune clé de provenance trouvée).
ja: この画像はMeowGramではありません（来歴キーが見つかりません）。

source: No hidden message found in this MeowGram.
de: In diesem MeowGram wurde keine versteckte Nachricht gefunden.
fr: Aucun message caché trouvé dans ce MeowGram.
ja: このMeowGramには隠しメッセージが見つかりませんでした。

source: Wrong passphrase — the message couldn't be unlocked.
de: Falsche Passphrase – die Nachricht konnte nicht entsperrt werden.
fr: Mauvaise phrase secrète — le message n'a pas pu être déverrouillé.
ja: パスフレーズが違います — メッセージのロックを解除できませんでした。

source: Message too long (%1$d bytes; max %2$d).
de: Nachricht zu lang (%1$d Bytes; max. %2$d).
fr: Message trop long (%1$d octets ; max %2$d).
ja: メッセージが長すぎます（%1$dバイト、最大%2$d）。

source: The embedded data is malformed.
de: Die eingebetteten Daten sind fehlerhaft.
fr: Les données intégrées sont corrompues.
ja: 埋め込まれたデータが壊れています。

source: Key: %@ — read it aloud to your recipient.
de: Schlüssel: %@ — lies ihn deinem Empfänger vor.
fr: Clé : %@ — lisez-la à voix haute à votre destinataire.
ja: キー：%@ — 相手に読み上げてください。

source: Pick a cat first!
de: Wähle zuerst eine Katze!
fr: Choisissez d'abord un chat !
ja: まず猫を選んでね！

source: Type a message first!
de: Tippe zuerst eine Nachricht!
fr: Saisissez d'abord un message !
ja: まずメッセージを入力してね！

source: Message is too long (%1$d/%2$d bytes).
de: Nachricht ist zu lang (%1$d/%2$d Bytes).
fr: Le message est trop long (%1$d/%2$d octets).
ja: メッセージが長すぎます（%1$d/%2$d バイト）。

source: Embedded! Ready to send.
de: Eingebettet! Bereit zum Senden.
fr: Intégré ! Prêt à envoyer.
ja: 埋め込み完了！送信できます。

source: Couldn't stage the attachment: %@
de: Anhang konnte nicht vorbereitet werden: %@
fr: Impossible de préparer la pièce jointe : %@
ja: 添付の準備に失敗しました：%@

source: No Mail account is set up — saving the PNG instead.
de: Kein Mail-Account eingerichtet – PNG wird stattdessen gespeichert.
fr: Aucun compte Mail configuré — le PNG est enregistré à la place.
ja: メールアカウントが未設定です — 代わりにPNGを保存します。

source: A MeowGram for you 🐱
de: Ein MeowGram für dich 🐱
fr: Un MeowGram pour vous 🐱
ja: あなたへの MeowGram 🐱

source: Handed off to Mail — hit send!
de: An Mail übergeben – jetzt senden!
fr: Transmis à Mail — envoyez-le !
ja: メールに引き渡しました — 送信してね！

source: Messages isn't available — saving the PNG instead.
de: Nachrichten ist nicht verfügbar – PNG wird stattdessen gespeichert.
fr: Messages n'est pas disponible — le PNG est enregistré à la place.
ja: メッセージが利用できません — 代わりにPNGを保存します。

source: Handed off to Messages — hit send!
de: An Nachrichten übergeben – jetzt senden!
fr: Transmis à Messages — envoyez-le !
ja: メッセージに引き渡しました — 送信してね！

source: I sent you a MeowGram! 🐱 Drop this PNG into MeowPassword to decode the hidden message. Keep it a PNG — don't screenshot or convert it, or the message is lost.
de: Ich habe dir ein MeowGram geschickt! 🐱 Zieh dieses PNG in MeowPassword, um die versteckte Nachricht zu dekodieren. Lass es ein PNG — kein Screenshot, keine Umwandlung, sonst geht die Nachricht verloren.
fr: Je vous ai envoyé un MeowGram ! 🐱 Déposez ce PNG dans MeowPassword pour décoder le message caché. Gardez-le en PNG — pas de capture d'écran ni de conversion, sinon le message est perdu.
ja: MeowGram を送りました！🐱 この PNG を MeowPassword にドロップすると隠しメッセージをデコードできます。PNG のまま — スクリーンショットや変換をすると、メッセージは失われます。

source: Couldn't stage the copy: %@
de: Kopie konnte nicht vorbereitet werden: %@
fr: Impossible de préparer la copie : %@
ja: コピーの準備に失敗しました：%@

source: Copied! Paste it as a PNG — image-paste targets may re-encode it.
de: Kopiert! Als PNG einfügen — Bild-Einfügeziele könnten es neu kodieren.
fr: Copié ! Collez-le en PNG — les cibles d'image peuvent le réencoder.
ja: コピーしました！PNG として貼り付けてね — 画像貼り付け先では再エンコードされることがあります。

source: Nothing to paste — copy a MeowGram image or PNG file first.
de: Nichts zum Einfügen – kopiere zuerst ein MeowGram-Bild oder eine PNG-Datei.
fr: Rien à coller — copiez d'abord une image MeowGram ou un fichier PNG.
ja: 貼り付けるものがありません — まず MeowGram 画像か PNG ファイルをコピーしてください。

source: Saved %@
de: Gespeichert: %@
fr: Enregistré : %@
ja: 保存しました：%@

source: That doesn't look like an image. Drop a MeowGram PNG.
de: Das sieht nicht nach einem Bild aus. Zieh ein MeowGram-PNG hierher.
fr: Cela ne ressemble pas à une image. Déposez un PNG MeowGram.
ja: 画像ではないようです。MeowGram の PNG をドロップしてください。

source: Couldn't read that file.
de: Diese Datei konnte nicht gelesen werden.
fr: Impossible de lire ce fichier.
ja: そのファイルを読み込めませんでした。

source: Couldn't read that pasted image.
de: Das eingefügte Bild konnte nicht gelesen werden.
fr: Impossible de lire l'image collée.
ja: 貼り付けた画像を読み込めませんでした。

source: No MeowGram here — JPEG/HEIC re-compression usually destroys them. Ask the sender for the original PNG.
de: Kein MeowGram — JPEG/HEIC-Neukomprimierung zerstört sie meist. Bitte den Absender um das Original-PNG.
fr: Aucun MeowGram ici — la recompression JPEG/HEIC les détruit souvent. Demandez le PNG original à l'expéditeur.
ja: MeowGram がありません — JPEG/HEIC の再圧縮でたいてい壊れます。送り主に元の PNG をもらってください。

source: Couldn't read that image as a MeowGram (%@).
de: Bild konnte nicht als MeowGram gelesen werden (%@).
fr: Impossible de lire cette image comme MeowGram (%@).
ja: この画像を MeowGram として読み込めませんでした（%@）。

source: THEME STUDIO
de: THEMEN-STUDIO
fr: STUDIO DES THÈMES
ja: テーマスタジオ

source: RESTORE PURCHASES
de: KÄUFE WIEDERHERSTELLEN
fr: RESTAURER LES ACHATS
ja: 購入を復元

source: SPY THRILLER
de: AGENTENTHRILLER
fr: THRILLER D'ESPIONNAGE
ja: スパイスリラー

source: KREMLIN CARTOON
de: KREML-KARIKATUR
fr: DESSIN DU KREMLIN
ja: クレムリン・カートゥーン

source: PYONGYANG POSTER
de: PJÖNGJANG-POSTER
fr: AFFICHE DE PYONGYANG
ja: ピョンヤン・ポスター

source: FREE
de: GRATIS
fr: GRATUIT
ja: むりょう

source: OWNED
de: GEKAUFT
fr: ACQUIS
ja: こうにゅうずみ

source: SELECTED
de: AKTIV
fr: ACTIF
ja: せんたくちゅう

source: USE IT!
de: ANLEGEN!
fr: PORTER !
ja: つかう！

source: RETRY
de: NOCHMAL
fr: RÉESSAYER
ja: さいしこう

source: PURCHASE PENDING
de: KAUF AUSSTEHEND
fr: ACHAT EN ATTENTE
ja: こうにゅうほりゅうちゅう

source: STORE HICCUP
de: STORE-SCHLUCKAUF
fr: HOQUET DE LA BOUTIQUE
ja: ストアのふちょう

source: Waiting for approval — your pack unlocks automatically once it's confirmed.
de: Warten auf Freigabe — dein Paket wird automatisch freigeschaltet, sobald der Kauf bestätigt ist.
fr: En attente d'approbation — votre pack se débloquera automatiquement une fois confirmé.
ja: しょうにんまちです — かくにんされるとパックはじどうでアンロックされます。

source: PASSPHRASE
fr: PHRASE SECRÈTE
ja: パスフレーズ

source: PASSPHRASE (OPTIONAL)
fr: PHRASE SECRÈTE (FACULTATIF)
ja: パスフレーズ（任意）

source: Build %@
fr: Version %@
ja: ビルド %@

source: EMAIL
ja: メール

source: SHŌWA BROADCAST
ja: 昭和ほうそう

source: GAMESHOW CLASSIC
ja: ゲームショー・クラシック
